--工作区
--2020年6月4日15:22:02
--2020年6月5日20:32:53
--BuildPipeline.BuildAssetBundles(outPath, BuildAssetBundleOptions.ChunkBasedCompression, EditorUserBuildSettings.activeBuildTarget);

--github
--参考文档
--https://www.runoob.com/w3cnote/git-five-minutes-tutorial.html
-- 与本地库与远程库建立关联 git remote add origin git@github.com:LiZhiMeng/Shaders.git
-- 本地创建master与远程库关联 git pull --rebase origin master
-- 最后推送 git push origin master

-- git init命令  把这个目录变成Git可以管理的仓库
-- git add . 把文件添加到仓库
-- git commit -m "record" 把文件提交到仓库
-- git status  查看仓库当前的状态
-- git diff “文件名”    查看文件的修改详情
-- git log  查看历史提交记录
-- git pull 更新本地库
-- git reset --hard HEAD^  回退至上一版本
-- git reset --hard asdfa   "asdfa"是版本号， 可使项目回退至指定版本，版本号没必要写全，前几位就可以了，Git会自动去找
-- 为什么Git添加文件需要add，commit一共两步呢？因为commit可以一次提交很多文件，所以你可以多次add不同的文件




--生活区

--在我的视角里，人们是如何赚钱的。
--每一步操作，背后的逻辑
-- 121B25  

--2020年5月16日09:25:49
--我应该怎么样去爱你，我美丽的小姐。你的温柔和淳真，娇羞与怯意。
--2020年5月23日15:08:36
--我看着外面的树叶，间隙，我觉得我和她们是一起的，感受太阳的温暖和风的律动。

--2020年5月29日15:14:43
--愈发感觉到，没有了力气，没有了活下去的力气。没有人在意我的感受，没有人爱我，我也没有了爱人的气力。为什么会这样呢。   时常感觉到很无助，无力， 不知道为什么， 遇到困难的时候。  也时常感觉心理徘徊在即将奔溃的边缘。 就像此刻，外面下大雨了，我没有带伞，但我也不知道向谁寻求帮助。 这样就回不了家，但我又需要回家。 但下雨没伞又回不了家。
--身边的每个人，是不是都讨厌我的，或者看不起我的。不喜欢我的呢？我身边有几个人呢。我快28岁了，问这个问题，是不是很不应该呢。

--2020年5月29日17:58:26
--怎么办， 为什么我没有甘愿赴死的勇气呢， 我也害怕这个勇气。 是因为害怕吗，我也不知道了。 我现在很怕走在高处，走在车流，或者危险地带了，连家里的长针我都害怕。我怕我会在无意识的情况下用它扎自己的心脏（我曾经动过这个念头，也是无意识下的）。

--2020年6月1日09:31:02
--今天六一儿童节，艳艳昨天说，今天要去街上检验，也有可能做手术了，在这个特殊的日子里，本来想说的一句儿童节快乐，突然变得讽刺了起来。谁是儿童呢。 为什么人生这么不堪呢。 看到同龄的朋友两个小孩了，其乐融融，轻松惬意，而我。 这种难过的日子，什么时候能到头呢。
--艳艳也不怎么理睬我了，信息也不回，电话也不接，  之前我以为已经习惯了，但其实还是没有。 特别是在艳艳现在可能已经有孕的情况下。  让我和艳本就有些敏感的关系（经济原因），变得更加烫手起来。    我现在整日处于混沌之中， 没有人能帮忙到我，我自己也无法从中自救出来， 所以每天都是煎熬。
--也没有与人说的必要，别人听了无法助我脱离，无济于事，更会增添厌烦。  就像祥林嫂。
--最近真的想得很多。但又想不出来个结果，只越想越头痛。  影响每日工作与学习与生活。  人也越来越怪了，看到同事也没心情打招呼， 似乎没有什么能让自己心情好起来，除非锻炼，看书，和学习的时候，能更平静一点，但一旦离开，就会陷入上面的情况。
--我想你了，艳艳。不要不理我好吗，你如能回我一句消息，我都能平静甚至恢复正常状态很长一段时间。  但在这种时刻，看到自己的这种心态， 也能感觉到自己似乎卑微到了尘埃里，  我不想这样，但也不办法。
--人们总是埋怨我，为什么挣不到钱，为什么这么没用。其实我和他们也一样，埋怨自己，为什么挣不到钱，导致生活艰难。我也想挣到钱，让大家过得轻松一点，过得好一点。我也想的，难道我不想让大家过得好一点吗？ 为什么都怪我， 我已经在努力了，可是，好像干啥啥不行，
--头脑也不够聪明，处世为人也不利索。 我没有去恶意伤害谁， 也许我已经尽力做到了我能做到，也许是真的像人们说的能力不够吧。我最近也常常忘事，丢三落四，学东西也慢，就像思维都退化了一样，加之心理这各种问题，已经不期待第二天的到来了， 因为痛苦既然是无止境的，
--那明日与今日有何区别，明天的苦痛只会比今天更多。
--我是不是太丧？
--经常一想到上个月发下来六千多块钱，然后从现实中惊醒。
--不知道艳艳现在怎么样了， 有没有去街上，  有没有真的怀孕了， 有没有去打胎。  一想到这些， 我即成了罪人。   我本来就觉得非常愧疚于她了，  没有带她去哪里旅行过， 或者送过好的礼物给她，  总是让她在朋友或者家人面前感觉到难堪。  这种难堪最后都会由于自尊新，转嫁到我自己的身上。  
--毕竟兜里没几块钱， 怎么好意思去见艳的家长呢。  真的能做到心态自如吗？   这一现状，何时才能得到改善呢。
--不仅在艳艳面前，似乎在很多社交场合，我都轻易的会卑微下去，进入自怜状态。 好像比谁都比不过这种。 看到别人比自己好的， 就觉得自卑，觉得自己不好。  这也是一个问题。
--这样讲起来， 自己的问题是不是太多了一点呢。   我好像还有点儿暴力倾向，当我觉得再也抑制不住内心的沉郁时。


--2020年6月1日12:39:24
--过几个月就28了，写一部记录 写下我的生平
--来自湖北一个普通家庭，小村落，背靠山。没有多余的介绍了。爸妈在东莞制造厂里打普工，他们没有受过什么教育，典型的旧社会的老好人，憨厚老实，努力打工，简单重复的生活，没有什么远大目标，但也不会偷懒，很自然的接受命运的安排。过着简单、单调的生活。没换过什么工作，在一个流水线上一做就是二十年，也没有待遇提升。也许他们也不知道自己想要什么，想做什么，已经麻木了，但他们
--仍然就勤勤恳恳的老实人，会善良对待身边人，也对我。这是我常常得意慰藉的地方，即使没有人爱我了，他们仍然爱我，无论我身处何地，过得怎样，有钱没钱，好还是坏。他们不遗余力的爱，让我感动。即使他们能力很有限，但他们总是为我着想，已为我尽了他们所能尽到的最大的努力和付出。我想，这是我以后无论如何也做不到的。
--也因此背景，我成为了留守儿童，与爷爷奶奶一起长大，上学时的寒暑假就去广州和爸妈一起。还能看到小时候那段时间一起在东莞住处的时光。给我买了很多玩具，一家人也挺开心的。
--小学1-3年级，就在村里的民办小学度过了，似乎从记事起，那时候我就郁郁寡欢，少言少语了。只是那时候只是简单的忧愁，是一种空洞的寂寞之感，一种过着无意义的生活的惆怅，不知道自己在干什么，该干什么，想干什么。懵懵懂懂的过着每一天，和其他人一起上学，写作业，放学，回家。即使回到家里，仍然会陷入这种状态，空洞的状态。
--仍然有两年事，还有印象。二年级时，当时在学汉字，学到“厂”字，就是工厂的厂，然后边上配图是几排并坐着的小朋友在读书的样子，我觉得很有趣，他们的样子很可爱，就像是我现在的样子，一个小孩子，坐在班上读书。然后就对这个“厂”字记忆尤深。
--三年级的时候上毛笔字的课，有一个来实习的年轻女教师（其实现在看来说不上多么漂亮，左脸中间位置还有个大黑痣）教我们。那天我在写毛笔字，然后我又坐在靠前排的位置，女老师当时坐在教师入口门边上监管，她有些失神的望向别处，当时是下午，阳光洒进来，铺到他的长发和身体，竟然看出来一道至美的轮廓，特别的她当时失神的样子，也没逃过我的眼睛，就在那一刻，我在心里向上苍发誓，只要能让我此刻单膝跪地亲吻着她的右手向她表白，我愿立刻化为碎骨。飘散在面前，绝不遗憾。
--然后就到了4年级，我还记得，爸妈决定带我去东莞他们工作的地方读书了，我还记得那天带我去报道的日子，去政务办公事，我当时很紧张，肯定像极了刘姥姥进大观园的样子。一切都很新鲜，比之前村里的学校大多少倍的校园，孩子们的活泼与青春热血，与之前村里的小学的老实孩子也全然不同。人们的玩具也是我都没见过的。
--我在那里虽然只读了一个学期，但是玩到了很多没见过，没玩过的东西，四驱车，陀螺，溜溜球等，这些之前都没见过，我还记得我那个一转起来就不灵不灵。还认识了一个朋友，是在当前住处楼下的开早餐店的老板的儿子，单名有个“杰”字，身材纤瘦，一个短寸，整个人看着挺精神和利落的。可能是投缘，这是我在那边仅有的朋友了。有一次他还来我家（也可能是我去他家，记不太清了），我们一起玩了好多小霸王游戏机，当时真挺开心的，有好朋友的感觉。我也喜欢他家的桂林米粉吃。常去吃，顺便瞟几眼他在不在里面，有几次我们还去边上散步，玩跷跷板，那是四年级的快乐时光。
--这段时间在学校里，班主任老师看着也挺温和的，其他班就都是本地的学生，就我们一个班都是外地来的，我记得我坐在右边靠窗的位置，有一次边上有个同学要开窗，但我不想开，然后我们就起了争执，最后我们把同一扇玻璃窗户对着推，结果把窗户从窗户架里抵出来了，掉到了地上，那次我有点慌了，怕老师和爸妈责怪，我也哭了，觉得对不起大家。
--但那次，也是我非常少有的，在冲突中敢于站出来，与别人正面争执。此后再也少有了，遇到冲突，我已经习惯性与对应妥协了。在我的潜意识里，已经被种下了“遇事要忍让，退一步海阔天空”等毒种，但这样子，失去原则与底线是非常可怕的，坏处最终都会降临到自身与心灵。失去争取与积极的心态。
--这段时间里还有一次，我的数学作业，十道题目，错了八道，当时爸爸因为这件事，训斥我比较厉害。可能在那时还没意识到，在数学相关的思维这块，是我的一个大弱点。但英文却不同，我没有别人那么努力，却可以拿到更高的分数，兴趣也更高，但当时没有分析到这些，仍旧是懵懵懂懂的。无法进行思维与思考。
--这段时间里，爸爸还给我订了每天早上会送过来的新鲜的热乎的牛奶放在挂在门口的专用的盒子里（我还记得名字里有个“晨”字，瓶子上印的log还有一头正在吃草的牛）。并且每天有校车接送去学校，司机总喜欢放两首歌，粤语版的“千千阙歌”与白话版的“流行雨”，他总放这两首，后来我竟然喜欢上了，多年以后，再听到这两首，总回忆起这段坐校车的无忧无虑的时光，仿佛昨日。但我也没想到，这竟然可能是我上学时期的人生巅峰了？
--这段时间里，我还喜欢上了那边的一个文具店（去年看，竟然还在，已经过了近二十年），里面有不少新书旧书，我当时喜欢上了一本英汉双语的什么系列的小说，ElephentMan,译做象人，讲述了长了一个像大象一样的头的，贫穷、丑陋的人的故事，没有人喜欢他，大家都嘲笑他。人们将他放在笼子里，当作动物一样展览。直到有一天一位医生发现了他，觉得他很有趣，想研究他。象人就这样出了名，每个人都想去拜访他，甚至女王都来看望他。这本我先把中文看完了，再又看了英文。只觉得特别，可能我当时还不能理解讽刺。
--再后来也不知道什么原因，我又回到了村里读书。五年级，六年级，初一，都在村里不远的学校。因为比较努力，但又因为脑子转得慢，所以成绩一直是中上，但又不特别拔尖。 
--读六年级的时候，我迷恋上了同村的一个女孩，个子小小的，五官比其他女同学精致一些，和我同姓，然后有一种傲娇的气质，总感觉和其他人不太一样，没那么俗吧，可能是。有一次在上学路上，偶遇到她。我走路快，她走在前面，我从后面超过她的时候，脸红得特别厉害，心跳都感觉要跳出来了。但我仍然什么都没说，只是强忍着匆匆走过去了。
--初一的时候，课件和同学在一起，他突然说，‘呀，好饿，想快点到中午就可以吃饭了’。  我当时很疑惑和真诚的问他，‘什么是饿，那是什么感觉，我怎么好像没有过’。 他看着我也很疑惑，仿佛我这个问题太过于惊世骇俗，他不甜睡怎么回答。
--也是初一的时候，也是这个同学，有一次中午大家去吃饭，学校都是同学早上带个大的铁茶杯，带点米，然后学校负责帮你们蒸熟，自己再带点下饭的菜就着吃。 然后我洗碗的时候刮到手了，就麻烦这位同学帮我洗一下，我手割出血了，还给他看了， 他听完也很热情的就要出手帮我洗， 但是然后我补了一句‘等下给你五毛钱’， 结果他转头走了， 我当时很疑惑，我做错了什么吗，我只是出于感谢朋友的好意（对于那时候的我们，五毛钱挺多了）。 我那时甚至觉得很委屈，为什么我的好心反倒被误会。
--初一如果是住校的话，住的就是地下室了（然后从初二到初三，也是住地下室那种宿舍，狭小的房间里，上下铺，一共8个铺位，每个铺位睡两个人）。 但我初一没住地下室，因为姑奶奶在这个学校教书，我就住在她那边，  我当时也没意识到，这可能也是我人生中唯一一次能和”有关系“沾边的时期了。
--初一寄宿学校的时候，有次洗衣服，我洗完没有怎么拧干，然后就往竹竿上晾，姑奶就批评我，不应该这样，对衣服不好。 我当时觉得，拧干也能能晒干，不拧干也能晒干，不拧干还能节省力气，所以应该不拧干。所以我表达了我的疑惑，结果姑奶奶好像讲了一个常识，我当时听完才明白原来是这么回事，之后我都尽量拧干了。但现在我已经不记得她当时说的是什么原因来着。只知道拧干比不拧干好。
--现在看来，村里读书与城市里确实差别挺大，接触事物的面，了解到的观点，见闻，玩的东西，接触的人，学到的东西，都不一样。相对农村，多样性在城市表现得淋漓尽致。至少，我在村里读小学生甚至初中八年多，能记起来的事甚少，但半年在城市里的时光，小事就能记得很多。而且那时候四年级城里已经教英文了，村里初一还有英文。教育的差距确实不一般。这也许是很多人想搬到大城市让子女受到更”好“的教育的起因。
--初一的时候还有件神奇的事，好像是姑妈送我的一块电子表，在当时同学眼里，应该是比较拿得出的东西，特殊材质的塑料表带，科技感足且大的表盘。戴在手上简直洋气极了。但爽了没几个月，好像给我弄丢了，伤心了挺长一段时间，就在我快要忘记这件事的时候，有次课件休息时，（打着打着字，突然有点想艳艳了，也不知道她现在心情怎么样）。有次课件休息时，突然看到别人手上戴了和我一样的表，然后我犹豫了一下，要不要去问个清楚，但又怕别人也买了这个。 后来终于还是鼓起勇气上去问了，他说是捡的，然后还我了。
--在这个小学-初一的学校里，上五天学住校，然后放两天假，再上五天学，这样子，记得夏天总是很炎热，知了的声音不停断，很是吵闹，冬天的时候，大家会带一个大铁茶杯，里面放些木炭然后拿到学校烤火，还有冬天的时候，外面飘零的雪花（我和艳艳一起看过雪吗，在一中的时候一起看过吧？我记不得了）。还真挺像电视里放的贫困地区留守儿童的生存情况的。但我们那时候都意识不到，只觉得没有很好，也没有多不好，温饱已可。只有时候还会想起在城市里读书的时光。
--初一差不多这样子，那时候也没有小升初的考试。直接去就行了。
--然后是初二初三，六岁一年级的话，十三、四岁吧。那时候的我，也是懵懵懂懂的一种状态，对很多事提不起兴趣，无法融入同龄人的生活，觉得他们太过于幼稚可笑，亦或者令我费解，也有些是我想融入，但实在不知道怎么做，最后放弃。我那时应该也是想和大家玩到一起，认识多一些朋友的，但是怎么也无法对他们敞开自己的内心。然后就内心矛盾。
--然后。。。






--2020年6月4日19:48:05
--为什么我们会感觉到没有什么话说呢，就像是，空洞的感觉，彼此。我以为，应该是无话不谈，言不尽的。但有时，都比较累的吧，也有一些忌惮，无话找话说的感觉就更加不好了。也许这是常态么。怎么会无话不谈呢。
--


--2020年6月6日11:35:18
--我感觉到内心满是煎熬，不知道过了多久可以改善。常常想到的是，上个月发了几千块钱，感觉自己和在工厂里的打工仔没有什么区别了。这种看不到未来和希望的感觉，非常的折磨人，每一天都在内心的煎熬中度过。艳艳，我想赚很多钱带你去玩遍世界的山山水水，怎么办。
--最近睡眠很差，有时候4点睡，有时候两点睡，精神状态更差了。真的要好好调整自己的心态了。有些事，不能强求了， 总想着有个朋友月收入2W，然后就对比自己，每天都生活在这种差距中。这样也是不行的，对自己只会坏处更多。
--好好睡觉真是太重要了，我最近晚上都只睡了三四个小时，白天都是蒙的，精神恍惚，有时候还突然会顿一下，感觉要停住了一样，像突然间要死去的感觉。有点后怕。然后很难思考，或者集中注意力，心情也会很差，在一种身累+心累的过程中，熬过这一天，这真的是煎熬，每分钟都要看着时间过。


--2020年6月12日11:56:37
--发现在将健身和阅读培养成了习惯之后，

--2020年7月6日10:11:09
--

--2020年7月15日10:11:19
--什么是爱情？
--什么是

--2020年7月18日09:48:49
--我觉得我有点神经病， 刚开始我跟人讲，他们不信，我很难过。   后来我跟人讲，别人信了， 我更难过了。
--

--2020年7月31日09:15:55
--昨天早上吃的炒米粉，不好吃，吃了一部分就丢了。
--上班写了一些打包的代码，编辑器代码，用于整理unity工具界面的。处理了项目里音效的问题，以及sv滑动与点击兼容的问题。
--晚上八点，和杨同学在东圃 木屋烧烤吃点东西， 晚上在东圃附近逛了下。 去了以前和明艳去过的 是与非书店， 里面主要是卖东西给小朋友的， 看到了几个小物品，准备给明艳买，感觉太小了又不合适。 有发带，相
--最近常想起来以前和艳艳过去在一起的情景，在珠海，在东莞，在客村。






--游戏区
--饥荒
--ctrl+F 无差别攻击
--F  攻击有敌意的敌人
--如何攻击火鸡    地上放一个浆果   在浆果与火鸡之间进行攻击
--捡花 回复5点san值
--san值掉到20%   会出影怪
--吃花 回血
--按住空格，再边按鼠标  获得双倍砍树速度
--建筑类东西可以制作在身上，但不放出来， 就可以起到解锁物品了，但不消耗的目的
--锤子敲掉建筑  返还1/2的材料
--沿着十字路走，可以找到猪王， 猪王休息在桦树林
--淋雨获得雨露值， 雨露值掉san
--雨露值越高，使用物品时，越可能掉在地止
--绿蘑菇，黄昏   蓝蘑菇，夜晚  红蘑菇，白天
--下雨时，火把 2%掉落，  平时是1%
--ctrl+F 杀蝴蝶  三个蝴蝶翅膀+一个肉， 可以做大肉
--蝴蝶是在花的地方刷新
--蝴蝶翅膀可以吃
--火坑中，一个时间格，是一个木头
--杀鼹鼠的方法  在他附近放一个隧石，它会被吸引过来，它起身的时候，长矛A一下
--P5  高脚鸟 A2走1
--锅做三个



--理财区

--股市

-- 时间    当日盈亏     总盈亏     余款    消费   收入    总资产
-- 8.6     +150         +528